Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатурыПоставщиков</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УчётнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УчётнаяПолитика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>УчётнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчётнойПолитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыПоставщиков</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыУчётнойПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчётнойПолитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрТЧ(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	СтрокаТЧ.ТипНоменклатуры = ПолучитьТипНоменклатуры(СтрокаТЧ.Номенклатура);
	УчётнаяПолитика = ПолучитьУчётнуюПолитику();
	СтрокаТЧ.СрокГодности = ?(УчётнаяПолитика = ПредопределенноеЗначение("Перечисление.ВидыУчётнойПолитики.FIFO"),
	ТекущаяДата() + СлучайноеЧисло(),
	"00010101");
	Дата = ТекущаяДата();
	СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПоКонтрагенту(СтрокаТЧ.Номенклатура, Объект.Поставщик, Дата); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипНоменклатуры(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Наименование = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ТипНоменклатуры;
КонецФункции

&НаСервере
Функция СлучайноеЧисло() Экспорт
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, 16777216);
	Возврат СлучайноеЧисло;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УчётнаяПолитика = ПолучитьУчётнуюПолитику();
	Элементы.ТоварыСрокГодности.Видимость = ?(УчётнаяПолитика = ПредопределенноеЗначение("Перечисление.ВидыУчётнойПолитики.FIFO"),
	Истина,
	Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУчётнуюПолитику()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчётнаяПолитикаСрезПоследних.УчётнаяПолитика КАК УчётнаяПолитика
	               |ИЗ
	               |	РегистрСведений.УчётнаяПолитика.СрезПоследних КАК УчётнаяПолитикаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.УчётнаяПолитика;
КонецФункции

&НаСервере
Функция ПолучитьЦеныДляОбновления(ТекДата, Поставщик, Ссылка)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровТовары.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |ГДЕ
	               |	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Номенклатура.НомерСтроки КАК НомерСтроки,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&Период, &Поставщик = Поставщик) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	               |		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура"
					;

	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Период", ТекДата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивДляВозврата = Новый Массив();
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДляВозврата.Добавить(Выборка.НомерСтроки);
			МассивДляВозврата.Добавить(Выборка.Цена);	
		КонецЦикла;
		Возврат МассивДляВозврата;
	КонецЕсли;
	
КонецФункции                  

&НаКлиенте
Процедура ОбновитьЦеныТЧ(Команда)
	СтрокаЦена = Новый Массив();
	СтрокаЦена = ПолучитьЦеныДляОбновления(Объект.Дата, Объект.Поставщик, Объект.Ссылка); 
	Счетчик = 0;
	Для Каждого Элемент Из Объект.Товары Цикл
		Если Элемент.НомерСтроки = СтрокаЦена[Счетчик]
			И СтрокаЦена[Счетчик + 1] <> 0 Тогда
			Элемент.Цена = СтрокаЦена[Счетчик + 1];
			Счетчик = Счетчик + 2;
		КонецЕсли;                            
	КонецЦикла;                    
КонецПроцедуры
